function changeH1TitleDescriptionDisplay() {
	let descriptionStyle = document.getElementById("h1-title-description").style.display;
	if (descriptionStyle == "none" || descriptionStyle == "") {
		document.getElementById("h1-title-description").style.display = "block"
	}
	else {
		document.getElementById("h1-title-description").style.display = "none"
	}
}

class Queue{
	constructor() {
		this.items = new Array()
	}

	is_empty() {
		return this.items.length == 0
	}

	//добавляет в начало
	enqueue(item) {
 		this.items.unshift(item)
	}

	//удаляет из конца и возращает
	dequeue() {
		return this.items.pop()
	}

	delete_first(){
		this.items.shift()
	}

	print_queue() {
		console.log(this.items);
	}
}

function cardMaker(theme, number, date, text) {
	this.theme = theme;
	this.number = number;
	this.date = date;
	this.text = text
}

function randomInteger(min, max) {
    var rand = min - 0.5 + Math.random() * (max - min + 1)
    rand = Math.round(rand);
    return rand;
  }

function randArr(list){
	l = [];
	h = 0;
	iter = list.length
	for (i = 0; i < iter; i++){
		h = randomInteger(0, list.length - 1);
		console.log(h);
		console.log(list[h]);
		l.push(list[h]);
		list.splice(h,1);
	}
	return l
}

function nextCard() {
	document.getElementById("removeCardButton").removeAttribute("disabled");
	if (cardsQueue.is_empty()) {
		document.getElementById("frontCardText").innerText = "Ви запам'ятали усі картки";
		document.getElementById("backCardDate").innerText = "Ви запам'ятали усі картки"
	}
	else if (cardsQueue.items.length == 1) {
		document.getElementById("removeCardButton").style.display = "none";
		document.getElementById("nextCardButton").style.display = "none"
	}
	document.getElementById("h1-title").innerText = "Карток залишилось: " + cardsQueue.items.length;
	lastItem = cardsQueue.dequeue();
	document.getElementById("frontCardTheme").innerText = lastItem.theme;
	document.getElementById("frontCardNumber").innerText = "#" + lastItem.number;
	document.getElementById("frontCardText").innerText = lastItem.text;
	document.getElementById("backCardTheme").innerText = lastItem.theme;
	document.getElementById("backCardNumber").innerText = "#" + lastItem.number;
	document.getElementById("backCardDate").innerText = lastItem.date;
	cardsQueue.enqueue(lastItem)
}

function removeCard() {
	cardsQueue.delete_first();
	nextCard()
}


cardsArray = [
new cardMaker("", 1, "1 млн. років тому", "Поява найдавніших людей на території сучасної України."),
new cardMaker("", 2, "1 млн – 11 тис. років тому", "Палеоліт або давній кам'яний вік."),
new cardMaker("", 3, "Близько 40–35 тис. років тому", "Поява на території сучасної України лю­дини сучасного типу."),
new cardMaker("", 4, "10–8 тис. років тому", "Мезоліт або середній кам'яний вік."),
new cardMaker("", 5, "8–5 тис. років тому", "Неоліт або новий кам'яний вік."),
new cardMaker("", 6, "Початок 4 – середина 3 тис. до н. е.", "Енеоліт або мідно-кам'яний вік."),
new cardMaker("", 7, "2 тис. р. до н.е. – VIII ст. до н.е.", "Бронзовий вік."),
new cardMaker("", 8, "VIII-IV ст. до н.е.", "Ранній залізний вік."),
new cardMaker("", 9, "IX-VII ст. до н.е.", "Панування в північних степах України кімерійців."),
new cardMaker("", 10, "VII-III ст. до н.е.", "Перебування на українських землях “скіфів”"),
new cardMaker("", 11, "III ст. до н.е. – III ст. н.е.", "Проживання на півдні України сарматів."),
new cardMaker("", 12, "І-ІІ ст.", "Перші згадки про слов'ян-венедів у писемних джерелах."),
new cardMaker("", 13, "	III-IV ст.", "Перебування готів на українських землях."),
new cardMaker("", 14, "V-VII ст.", "Велике слов'янське розселення."),
new cardMaker("Виникнення та розквіт  Київської Русі", 15, "Кінець VIII – початок IX ст.", "Утворення Київського князівства."),
new cardMaker("Виникнення та розквіт  Київської Русі", 16, "860 р.", "Перший похід русичів, очолюваних князем Аскольдом на Константинополь (Царгород)."),
new cardMaker("Виникнення та розквіт  Київської Русі", 17, "882 р.", "Убивство князя Аскольда та захоплення князівської влади в Києві Олегом. Виникнення держави Київська Русь."),
new cardMaker("Виникнення та розквіт  Київської Русі", 18, "907, 911р.", "Походи князя Олега на Царгород."),
new cardMaker("Виникнення та розквіт  Київської Русі", 19, "941, 944 р.", "Походи князя Ігоря на Візантію."),
new cardMaker("Виникнення та розквіт  Київської Русі", 20, "945 р.", " Повстання деревлян і вбивство князя Ігоря."),
new cardMaker("Виникнення та розквіт  Київської Русі", 21, "946 р.", "Посольство княгині Ольги до Царгорода."),
new cardMaker("Виникнення та розквіт  Київської Русі", 22, "968 р.", "Перший Балканський похід князя Святослава."),
new cardMaker("Виникнення та розквіт  Київської Русі", 23, "969–971 pp.", "Другий Балканський похід князя Святослава."),
new cardMaker("Виникнення та розквіт  Київської Русі", 24, "988 р.", "Початок запровадження князем Володимиром християнства як державної релігії Київської Русі"),
new cardMaker("Виникнення та розквіт  Київської Русі", 25, "1036 р.", "Розгром князем Ярославом Мудрим печенігів під Києвом."),
new cardMaker("Виникнення та розквіт  Київської Русі", 26, "1054 р.", "Перша згадка в літописі Києво-Печерського монастиря."),
new cardMaker("Виникнення та розквіт  Київської Русі", 27, "1054–1113 рр.", "Співправління трьох братів Ярославичів – Ізяслава, Святослава та Всеволода."),
new cardMaker("Виникнення та розквіт  Київської Русі", 28, "1068 р.", "Повстання в Києві проти Ярославичів."),
new cardMaker("Виникнення та розквіт  Київської Русі", 29, "1097 р.", "Любецький з'їзд князів."),
new cardMaker("Виникнення та розквіт  Київської Русі", 30, "1113р.", "Народне повстання в Києві."),
new cardMaker("Виникнення та розквіт  Київської Русі", 31, "1113 р.", 'Прийняття "Статуту" Володимира Мономаха.'),
new cardMaker("Київська Русь за часів роздробленості. Галицько-Волинська держава", 32, "1152–1187 рр.", "Зміцнення Галицького князівства за правління Ярослава Осмомисла."),
new cardMaker("Київська Русь за часів роздробленості. Галицько-Волинська держава", 33, "1169 р.", "Захоплення й розорення Києва об'єднаним військом 12 руських князів, очолюваним Андрієм Боголюбським."),
new cardMaker("Київська Русь за часів роздробленості. Галицько-Волинська держава", 34, "1185 р.", 'Невдалий похід новгород-сіверського князя Ігоря Святославича проти половців, що став підґрунтям для поеми "Слово о полку Ігоревім".'),
new cardMaker("Київська Русь за часів роздробленості. Галицько-Волинська держава", 35, "1187р.", 'Перша літописна згадка назви "Україна" стосовно земель Південної Київщини та Переяславщини.'),
new cardMaker("Київська Русь за часів роздробленості. Галицько-Волинська держава", 36, "1199 р.", "Об'єднання волинським князем Романом Мстиславичем Галицької і Волинської земель."),
new cardMaker("Київська Русь за часів роздробленості. Галицько-Волинська держава", 37, "1206–1238 pp.", "Утворення Галицько-Волинського князівства Період міжусобиць, боярських змов та іноземного втручання в галицько-волинські справи."),
new cardMaker("Київська Русь за часів роздробленості. Галицько-Волинська держава", 38, "31 травня 1223 р.", "Битва на річці Калці."),
new cardMaker("Київська Русь за часів роздробленості. Галицько-Волинська держава", 39, "1238 р.", "Утвердження князя Данила Романовича в Галичі. Розгром військом Данила Галицького рицарів-хрестоносців під Дорогочином."),
new cardMaker("Київська Русь за часів роздробленості. Галицько-Волинська держава", 40, "1239 р.", "Спустошення монголами Переяславської й Чернігівської земель."),
new cardMaker("Київська Русь за часів роздробленості. Галицько-Волинська держава", 41, "Кінець листопада – початок грудня 1240 р.", "Облога й захоплення Києва військами монгольського хана Батия."),
new cardMaker("Київська Русь за часів роздробленості. Галицько-Волинська держава", 42, "Грудень 1240 р. – березень 1241 р.", "Спустошення монголами земель Київського та Галицько-Волинського князівств."),
new cardMaker("Київська Русь за часів роздробленості. Галицько-Волинська держава", 43, "17 серпня 1245 р.", "Ярославська битва."),
new cardMaker("Київська Русь за часів роздробленості. Галицько-Волинська держава", 44, "1253 р.", "Коронування Данила Галицького послами Папи Римського Інокентія IV."),
new cardMaker("Київська Русь за часів роздробленості. Галицько-Волинська держава", 45, "1264 р.", "Смерть Данила Галицького."),
new cardMaker("Київська Русь за часів роздробленості. Галицько-Волинська держава", 46, "1264–1301 pp.", "Князювання Лева Даниловича  (сина Данила Галицького) у Галицькій та Перемишльській землях."),
new cardMaker("Київська Русь за часів роздробленості. Галицько-Волинська держава", 47, "1269–1288 pp.", "Князювання Володимира Васильковича (сина Василька Романовича, брата Данила Галицького) на Волині."),
new cardMaker("Київська Русь за часів роздробленості. Галицько-Волинська держава", 48, "1301–1308(15) pp.", "Правління Юрія І Львовича, що об'єднав під своєю владою всі землі Галицько-Волинської держави"),
new cardMaker("Київська Русь за часів роздробленості. Галицько-Волинська держава", 49, "1315–1323 pp.", "Князювання в Галицько-Волинському князівстві Андрія та Лева II Юрійовичів"),
new cardMaker("Київська Русь за часів роздробленості. Галицько-Волинська держава", 50, "1324–1340 pp.", "Князювання в Галицько-Волинській державі Мазовецького княжича Болеслава Юрія II")
]

cardsArray = randArr(cardsArray);

cardsQueue = new Queue;

cardsArray.forEach(function(item, i, cardsArray) {
	cardsQueue.enqueue(item);
});

document.getElementById("h1-title").innerText = "Карток залишилось: " + cardsQueue.items.length;	
